IDEA Open Model
OpenModelResult.LoadFromXmlFile Method
Compatible with IDEA StatiCa v 10.1
 Creates the instance of Open Model Result from the XML file
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public static OpenModelResult LoadFromXmlFile(
	string xmlFileName
)
Public Shared Function LoadFromXmlFile (
	xmlFileName As String
) As OpenModelResult
public:
static OpenModelResult^ LoadFromXmlFile(
	String^ xmlFileName
)
Parameters
xmlFileName
Type: System.String
XML file name
Return Value
Type: OpenModelResult
Open Model Result or null
See Also
Reference
OpenModelResult Class
IdeaRS.OpenModel.Result Namespace